/**
 * Реализовать консольный вариант игры «быки и коровы»
 * Вначале пользователю предлагается ввести сложность игры – 3, 4 или 5. Сложность игры – длина загадываемой программой последовательности цифр (0-9). При вводе некоректной сложности игра завершается.
 * После определения сложности игры, программа генерирует случайную последовательность цифр, при чем все цифры должны быть разными(например, 0247).
 * После этого пользователю предлагает ввести свою отгадку последовательности. Валидной попыткой считается последовательность различных цифр правильной длины (например, 1234). Невалидные попытки отклоняются.
 * Для валидной попытки программа должна выдать пользователю результат совпадения – 2 числа:
 * 1 число – «коровы» – число угаданных цифр, которые находятся на неправильных позициях;
 * 2 число – «быки» - число угаданных цифр, которые находятся на правильных позициях;
 * Если после попытки пользователь полностью правильно угадал загаданную последовательность, то ему выводится сообщение об успехе, значение загаданной последовательности и количество попыток. Игра завершается.
 * Если после попытки пользователь не угадал последовательность, то ему предлагается сделать следующую попытку.
 * В качестве попытки пользователь может напечатать «сдаюсь». Тогда ему будет выведена загаданная последовательность и игра завершится.
 */
public class BullsAndCowsGame {
    public static void main(String[] args) {

    }
}
