public class MyComparator {
    /**
     * Реализовать метод, возвращающий максимальное число
     */
    public static void main(String[] args) {
        System.out.println(Math.max(10, 15));
    }

    public int max(int a, int b) {
        Math.max(a, b);
        return 0;
    }
}
